OpenFOAM/FE41/tutorials/forwardStep/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="allMachFoam"

runApplication blockMesh
runApplication $application
